espressif/esp-idf/components/soc/esp32s31/register/soc/cnnt_io_mux_reg.h
/** CNNT_IO_MUX_GMAC_PHY_RXD2_REG register
 *  GMAC IO MUX configuration register for GMAC_PHY_RXD2
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_REG (DR_REG_CNNT_IO_MUX_BASE + 0x10)
/** CNNT_IO_MUX_GMAC_PHY_RXD2_SLP_SEL : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to enter sleep mode for GMAC_PHY_RXD2.
 *  0: Not enter
 *  1: Enter
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_SLP_SEL    (BIT(0))
#define CNNT_IO_MUX_GMAC_PHY_RXD2_SLP_SEL_M  (CNNT_IO_MUX_GMAC_PHY_RXD2_SLP_SEL_V << CNNT_IO_MUX_GMAC_PHY_RXD2_SLP_SEL_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD2_SLP_SEL_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_SLP_SEL_S  0
/** CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPD : R/W; bitpos: [1]; default: 0;
 *  Configure whether or not to enable pull-down resistor of GMAC_PHY_RXD2 in sleep
 *  mode.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPD    (BIT(1))
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPD_M  (CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPD_V << CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPD_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPD_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPD_S  1
/** CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPU : R/W; bitpos: [2]; default: 0;
 *  Configures whether or not to enable pull-up resistor of GMAC_PHY_RXD2 during sleep
 *  mode.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPU    (BIT(2))
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPU_M  (CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPU_V << CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPU_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPU_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_WPU_S  2
/** CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_IE : R/W; bitpos: [3]; default: 1;
 *  Configures whether or not to enable the input of GMAC_PHY_RXD2 during sleep mode.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_IE    (BIT(3))
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_IE_M  (CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_IE_V << CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_IE_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_IE_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_IE_S  3
/** CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_DRV : R/W; bitpos: [5:4]; default: 2;
 *  Configures the drive strength of GMAC_PHY_RXD2 during sleep mode.
 *  0: ~5 mA
 *  1: ~10 mA
 *  2: ~20 mA
 *  3: ~40 mA
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_DRV    0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_DRV_M  (CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_DRV_V << CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_DRV_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_DRV_V  0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_MCU_DRV_S  4
/** CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPD : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to enable pull-down resistor of GMAC_PHY_RXD2.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPD    (BIT(6))
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPD_M  (CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPD_V << CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPD_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPD_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPD_S  6
/** CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPU : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not enable pull-up resistor of GMAC_PHY_RXD2.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPU    (BIT(7))
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPU_M  (CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPU_V << CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPU_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPU_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_WPU_S  7
/** CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_IE : R/W; bitpos: [8]; default: 1;
 *  Configures whether or not to enable input of GMAC_PHY_RXD2.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_IE    (BIT(8))
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_IE_M  (CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_IE_V << CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_IE_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_IE_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_IE_S  8
/** CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_DRV : R/W; bitpos: [10:9]; default: 2;
 *  Configures the drive strength of GMAC_PHY_RXD2.
 *  0: ~5 mA
 *  1: ~10 mA
 *  2: ~20 mA
 *  3: ~40 mA
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_DRV    0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_DRV_M  (CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_DRV_V << CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_DRV_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_DRV_V  0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_FUN_DRV_S  9
/** CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable the hysteresis function of the pin when
 *  CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_SEL is set to 1.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_EN    (BIT(11))
#define CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_EN_M  (CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_EN_V << CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_EN_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_EN_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_EN_S  11
/** CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_SEL : R/W; bitpos: [12]; default: 0;
 *  Configures to choose the signal for enabling the hysteresis function for
 *  GMAC_PHY_RXD2.
 *  0: Choose the output enable signal of eFuse
 *  1: Choose the output enable signal of CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_EN
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_SEL    (BIT(12))
#define CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_SEL_M  (CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_SEL_V << CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_SEL_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_SEL_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD2_HYS_SEL_S  12

/** CNNT_IO_MUX_GMAC_PHY_RXD1_REG register
 *  GMAC IO MUX configuration register for GMAC_PHY_RXD1
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_REG (DR_REG_CNNT_IO_MUX_BASE + 0x14)
/** CNNT_IO_MUX_GMAC_PHY_RXD1_SLP_SEL : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to enter sleep mode for GMAC_PHY_RXD1.
 *  0: Not enter
 *  1: Enter
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_SLP_SEL    (BIT(0))
#define CNNT_IO_MUX_GMAC_PHY_RXD1_SLP_SEL_M  (CNNT_IO_MUX_GMAC_PHY_RXD1_SLP_SEL_V << CNNT_IO_MUX_GMAC_PHY_RXD1_SLP_SEL_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD1_SLP_SEL_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_SLP_SEL_S  0
/** CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPD : R/W; bitpos: [1]; default: 0;
 *  Configure whether or not to enable pull-down resistor of GMAC_PHY_RXD1 in sleep
 *  mode.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPD    (BIT(1))
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPD_M  (CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPD_V << CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPD_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPD_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPD_S  1
/** CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPU : R/W; bitpos: [2]; default: 0;
 *  Configures whether or not to enable pull-up resistor of GMAC_PHY_RXD1 during sleep
 *  mode.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPU    (BIT(2))
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPU_M  (CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPU_V << CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPU_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPU_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_WPU_S  2
/** CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_IE : R/W; bitpos: [3]; default: 1;
 *  Configures whether or not to enable the input of GMAC_PHY_RXD1 during sleep mode.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_IE    (BIT(3))
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_IE_M  (CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_IE_V << CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_IE_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_IE_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_IE_S  3
/** CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_DRV : R/W; bitpos: [5:4]; default: 2;
 *  Configures the drive strength of GMAC_PHY_RXD1 during sleep mode.
 *  0: ~5 mA
 *  1: ~10 mA
 *  2: ~20 mA
 *  3: ~40 mA
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_DRV    0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_DRV_M  (CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_DRV_V << CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_DRV_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_DRV_V  0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_MCU_DRV_S  4
/** CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPD : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to enable pull-down resistor of GMAC_PHY_RXD1.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPD    (BIT(6))
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPD_M  (CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPD_V << CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPD_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPD_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPD_S  6
/** CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPU : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not enable pull-up resistor of GMAC_PHY_RXD1.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPU    (BIT(7))
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPU_M  (CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPU_V << CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPU_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPU_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_WPU_S  7
/** CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_IE : R/W; bitpos: [8]; default: 1;
 *  Configures whether or not to enable input of GMAC_PHY_RXD1.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_IE    (BIT(8))
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_IE_M  (CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_IE_V << CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_IE_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_IE_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_IE_S  8
/** CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_DRV : R/W; bitpos: [10:9]; default: 2;
 *  Configures the drive strength of GMAC_PHY_RXD1.
 *  0: ~5 mA
 *  1: ~10 mA
 *  2: ~20 mA
 *  3: ~40 mA
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_DRV    0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_DRV_M  (CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_DRV_V << CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_DRV_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_DRV_V  0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_FUN_DRV_S  9
/** CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable the hysteresis function of the pin when
 *  CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_SEL is set to 1.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_EN    (BIT(11))
#define CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_EN_M  (CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_EN_V << CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_EN_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_EN_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_EN_S  11
/** CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_SEL : R/W; bitpos: [12]; default: 0;
 *  Configures to choose the signal for enabling the hysteresis function for
 *  GMAC_PHY_RXD1.
 *  0: Choose the output enable signal of eFuse
 *  1: Choose the output enable signal of CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_EN
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_SEL    (BIT(12))
#define CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_SEL_M  (CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_SEL_V << CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_SEL_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_SEL_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD1_HYS_SEL_S  12

/** CNNT_IO_MUX_GMAC_PHY_RXD0_REG register
 *  GMAC IO MUX configuration register for GMAC_PHY_RXD0
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_REG (DR_REG_CNNT_IO_MUX_BASE + 0x18)
/** CNNT_IO_MUX_GMAC_PHY_RXD0_SLP_SEL : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to enter sleep mode for GMAC_PHY_RXD0.
 *  0: Not enter
 *  1: Enter
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_SLP_SEL    (BIT(0))
#define CNNT_IO_MUX_GMAC_PHY_RXD0_SLP_SEL_M  (CNNT_IO_MUX_GMAC_PHY_RXD0_SLP_SEL_V << CNNT_IO_MUX_GMAC_PHY_RXD0_SLP_SEL_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD0_SLP_SEL_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_SLP_SEL_S  0
/** CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPD : R/W; bitpos: [1]; default: 0;
 *  Configure whether or not to enable pull-down resistor of GMAC_PHY_RXD0 in sleep
 *  mode.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPD    (BIT(1))
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPD_M  (CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPD_V << CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPD_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPD_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPD_S  1
/** CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPU : R/W; bitpos: [2]; default: 0;
 *  Configures whether or not to enable pull-up resistor of GMAC_PHY_RXD0 during sleep
 *  mode.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPU    (BIT(2))
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPU_M  (CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPU_V << CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPU_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPU_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_WPU_S  2
/** CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_IE : R/W; bitpos: [3]; default: 1;
 *  Configures whether or not to enable the input of GMAC_PHY_RXD0 during sleep mode.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_IE    (BIT(3))
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_IE_M  (CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_IE_V << CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_IE_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_IE_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_IE_S  3
/** CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_DRV : R/W; bitpos: [5:4]; default: 2;
 *  Configures the drive strength of GMAC_PHY_RXD0 during sleep mode.
 *  0: ~5 mA
 *  1: ~10 mA
 *  2: ~20 mA
 *  3: ~40 mA
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_DRV    0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_DRV_M  (CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_DRV_V << CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_DRV_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_DRV_V  0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_MCU_DRV_S  4
/** CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPD : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to enable pull-down resistor of GMAC_PHY_RXD0.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPD    (BIT(6))
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPD_M  (CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPD_V << CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPD_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPD_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPD_S  6
/** CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPU : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not enable pull-up resistor of GMAC_PHY_RXD0.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPU    (BIT(7))
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPU_M  (CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPU_V << CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPU_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPU_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_WPU_S  7
/** CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_IE : R/W; bitpos: [8]; default: 1;
 *  Configures whether or not to enable input of GMAC_PHY_RXD0.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_IE    (BIT(8))
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_IE_M  (CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_IE_V << CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_IE_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_IE_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_IE_S  8
/** CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_DRV : R/W; bitpos: [10:9]; default: 2;
 *  Configures the drive strength of GMAC_PHY_RXD0.
 *  0: ~5 mA
 *  1: ~10 mA
 *  2: ~20 mA
 *  3: ~40 mA
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_DRV    0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_DRV_M  (CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_DRV_V << CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_DRV_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_DRV_V  0x00000003U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_FUN_DRV_S  9
/** CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable the hysteresis function of the pin when
 *  CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_SEL is set to 1.
 *  0: Disable
 *  1: Enable
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_EN    (BIT(11))
#define CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_EN_M  (CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_EN_V << CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_EN_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_EN_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_EN_S  11
/** CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_SEL : R/W; bitpos: [12]; default: 0;
 *  Configures to choose the signal for enabling the hysteresis function for
 *  GMAC_PHY_RXD0.
 *  0: Choose the output enable signal of eFuse
 *  1: Choose the output enable signal of CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_EN
 */
#define CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_SEL    (BIT(12))
#define CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_SEL_M  (CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_SEL_V << CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_SEL_S)
#define CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_SEL_V  0x00000001U
#define CNNT_IO_MUX_GMAC_PHY_RXD0_HYS_SEL_S  12

